app/controllers/songs_controller.rb

  def upload
    CSV.foreach(params[:file].path, headers: true) do |song|
      binding.pry
      Song.create()
---
INSERT INTO "songs" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2018-06-28 15:32:12.608444"], ["updated_at", "2018-06-28 15:32:12.608444"]]